## Production: route53
**✅ &nbsp; Terraform Init:** `success`
**✅ &nbsp; Terraform Validate:** `success`
**✅ &nbsp; Terraform Format:** `success`
**✅ &nbsp; Terraform Plan:** `success`
**✅ &nbsp; Conftest:** `success` 

```terraform
Plan: 1 to add, 0 to change, 0 to destroy
```

<details>
<summary>Show summary</summary>

| CHANGE |            NAME            |
|--------|----------------------------|
| add    | `aws_route53_zone.website` |


</details>


<details>
<summary>Show plan</summary>

```terraform
Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_route53_zone.website will be created
  + resource "aws_route53_zone" "website" {
      + arn                 = (known after apply)
      + comment             = "Managed by Terraform"
      + force_destroy       = false
      + id                  = (known after apply)
      + name                = "design.cdssandbox.xyz"
      + name_servers        = (known after apply)
      + primary_name_server = (known after apply)
      + tags                = {
          + "CostCentre" = "gc-design-system-production"
          + "Terraform"  = "true"
        }
      + tags_all            = {
          + "CostCentre" = "gc-design-system-production"
          + "Terraform"  = "true"
        }
      + zone_id             = (known after apply)
    }

Plan: 1 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  - hosted_zone_id         = "Z0187089115L834W3TQZN" -> null
  + hosted_zone_id_cdn     = "Z0187089115L834W3TQZN"
  + hosted_zone_id_website = (known after apply)

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: plan.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "plan.tfplan"

```

</details>

<details>
<summary>Show Conftest results</summary>

```sh

18 tests, 18 passed, 0 warnings, 0 failures, 0 exceptions

```

</details>
